[
  {
    "img": "http://i.cdn.ensonhaber.com/resimler/diger/ataturk_3473.jpg",
    "year": "1980",
    "content": "NITK's annual cultural extravaganza, Incident began in the year 1080. With a budget of Rs. 10000, Incident, led by Umar Teekay held its first events in the Student Activity Center. It has now grown into one of South India's largest cultural festivals celebrating culture, art and life, with an average footfall of 30000 students and people visiting the campus from all over India.",
    "dataText": "INCEPTION OF INCIDENT"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "1990",
    "content": "1990, the 10th anniversary of Incident was a landmark to remember. The fest had become a legend among the Mangaloreans, incorporating new norms and trends every year. It was the state's favourite and most awaited fest and has continued to live up to the crowd's expectation by growing bigger and having more amazing additions to the festival.",
    "dataText": "STATE FAVOURITE FEST"
  },
  {
    "img": "http://i.cdn.ensonhaber.com/resimler/diger/ataturk_3473.jpg",
    "year": "1992",
    "content": "Incident, NITK's much celebrated cultural fest began in the 1980. In 1992, one of the biggest industries in Mangaluru then, PVS Beedies Pvt. Ltd., sponsored Incident and history was created when Inci held fashion show contests for the first time. Now, Haute Couture is the flagship fashion event of Inci and is one of the biggest events of its kind in the country giving budding fashionistas and enthusiasts an amazing platform for exhibiting their talents.",
    "dataText": "HAUTE COUTURE"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "2005",
    "content": "2005 saw Incident achieve new heights with its biggest revolution ever! Yes, they'd just introduced the Pronites as a part of Incident and the celebration was considered a whole new level of amazing. The crowd was swept of it's feet by the beats of Parikrima, a Delhi based Rock band who definitely made Incident 2005, one to remember for years to come.",
    "dataText": "PARIKRAMA AT PRONITES"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "2006",
    "content": "NITK grabbed its perks of owning its very own private beach in 2006 when it introduced 'beach events' for Incident. A full blown beach party featuring the War of DJs, kite flying, beach volleyball, beach football and jet skiing and speed boating to explore the dangerous waters. Starting off small with just a budget of Rs10000, it has now grown to become one of the largest cultural fests of South India.",
    "dataText": "BEACH EVENTS"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "2012",
    "content": "As a part of Incident, we embrace our responsibility to create a positive impact in the communities in which we are living. Incident's I-Care initiative focuses on programs in social awareness, education, childcare, environmental protection and women empowerment.The beach schooling program started in 2016, provides free tuition and stationery to students of the nearby government schools. With more initiatives being taken every year, we are hoping to make an impact on a large scale.",
    "dataText": "I-CARE"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "2014",
    "content": "March 5, 2014. These next four days attracted about 30,000 footfall with people from all over 65 colleges and from all around the country.The World Fest, an impressive performance by the \"Dancing Dean\" where the Dean of the college was the star performer of the evening. The shows by the Turbans Band and Lisa Angel & Miguel left everyone cheering for more. Salim Sulaiman gave the perfect ending for Incident 2014.",
    "dataText": "WORLD FEST"
  },
  {
    "img": "http://gazetemanifesto.com/wp-content/uploads/2015/11/mustafa-kemal.jpg",
    "year": "2015",
    "content": "One of the most awaited and sensational events at Incident are the Pronites. Pronites feature some of the best national and international artists covering numerous genres of music including pop, metal, rock, Sufi and Bollywood. Stalwarts like Vishal Dadlani, Sunidhi Chauhan, KK and many more have graced and entertained the crowd. In 2015, Incident touched new heights as this was the first year that saw Pronites in the Main Grounds.",
    "dataText": "PRONITES IN THE MAIN GROUND"
  }
]
